app/views/comments/_comment.html.erb

<h3> This post has <%= pluralize(@comments.count, "Comment") %> </h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 22 ORDER BY created_at DESC
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 22