app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?, ?)  [["content", ""], ["post_id", 22], ["user_id", 1], ["created_at", "2017-11-15 06:16:01.314292"], ["updated_at", "2017-11-15 06:16:01.314292"], ["picture", "ttt.png"]]
---
	def create
		@comment = @post.comments.create(comment_params)

UPDATE "comments" SET "picture" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["picture", "Screen_Shot_2017-08-05_at_11.15.03_AM.png"], ["updated_at", "2017-11-15 06:17:16.890165"], ["id", 34]]
---
	def update
		#if @comment.update(params[:comment].permit(:content))
		if @comment.update(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 10], ["id", 42], ["LIMIT", 1]]
---
	def find_comment
		@comment = @post.comments.find(params[:id])