app/controllers/posts_controller.rb

  def show
    @comments = Comment.where(post_id: @post).order("created_at DESC")
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 22 ORDER BY created_at DESC

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("headline", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["headline", "this club has user id"], ["content", "yes?"], ["created_at", "2017-10-27 06:33:14.328958"], ["updated_at", "2017-10-27 06:33:14.328958"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "headline" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["headline", "test1test1test1test1test1test1test1test1test1test1test1test1test1test1test1"], ["updated_at", "2017-11-01 00:37:40.421662"], ["id", 7]]